On-Campus/Week-6/rescue-mission/app/controllers/questions_controller.rb

  def index
    @questions = Question.all.order(created_at: :desc)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def show
    @question = Question.find(params["id"])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    @question = Question.new(question_params)
    if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["description", "I'm not sure how I got here but this is not my beautiful wife? This is a new edit to the description."], ["updated_at", "2020-07-17 10:51:46.348593"], ["id", 1]]

  def destroy
    Question.find(params[:id]).destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 4]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]