On-Campus/Week-6/building-an-api-in-rails/app/controllers/api/v1/campers_controller.rb

SELECT "campers".* FROM "campers"
---
  def index
    render json: Camper.all