On-Campus/Week-6/rescue-mission-2/app/controllers/questions_controller.rb

    def index
        # In order to organize our list by date to be displayed on our Index page, we use .order command here to be sorted before getting iterated through in the Index
        @questions = Question.all.order(created_at: :desc)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

    def show
        # This will be used on our show page, and it will correlate the article matching the id in the url, that's provided by the link in the index
        @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        @question = Question.new(question_params)

        if @question.save
---
INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"