On-Campus/Week-6/rails-marathon/app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "author", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "apple"], ["author", "apple"], ["source", "apple"], ["created_at", "2020-07-17 00:30:45.619096"], ["updated_at", "2020-07-17 00:30:45.619096"]]
---
  def create
    @house = House.new(house_params)
    if @house.save